wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_trigsel.h
/*!
    \file    gd32g5x3_trigsel.h
    \brief   definitions for the TRIGSEL

    \version 2026-02-04, V1.5.0, firmware for GD32G5x3
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef GD32G5X3_TRIGSEL_H
#define GD32G5X3_TRIGSEL_H

#include "gd32g5x3.h"

/* TRIGSEL definitions */
#define TRIGSEL                           TRIGSEL_BASE                      /*!< TRIGSEL base address */

/* register definitions */
#define TRIGSEL_EXTOUT_0                  REG32((TRIGSEL) + 0x00000000U)    /*!< TRIGSEL trigger selection for EXTOUT register 0 */
#define TRIGSEL_EXTOUT_1                  REG32((TRIGSEL) + 0x00000004U)    /*!< TRIGSEL trigger selection for EXTOUT register 1 */
#define TRIGSEL_EXTOUT_2                  REG32((TRIGSEL) + 0x00000008U)    /*!< TRIGSEL trigger selection for EXTOUT register 2 */
#define TRIGSEL_EXTOUT_3                  REG32((TRIGSEL) + 0x0000000CU)    /*!< TRIGSEL trigger selection for EXTOUT register 3 */
#define TRIGSEL_ADC0                      REG32((TRIGSEL) + 0x00000010U)    /*!< TRIGSEL trigger selection for ADC0 register */
#define TRIGSEL_ADC1                      REG32((TRIGSEL) + 0x00000014U)    /*!< TRIGSEL trigger selection for ADC1 register */
#define TRIGSEL_ADC2                      REG32((TRIGSEL) + 0x00000018U)    /*!< TRIGSEL trigger selection for ADC2 register */
#define TRIGSEL_ADC3                      REG32((TRIGSEL) + 0x0000001CU)    /*!< TRIGSEL trigger selection for ADC3 register */
#define TRIGSEL_TIMER0BRKIN               REG32((TRIGSEL) + 0x0000002CU)    /*!< TRIGSEL trigger selection for TIMER0_BRKIN register */
#define TRIGSEL_TIMER7BRKIN               REG32((TRIGSEL) + 0x00000030U)    /*!< TRIGSEL trigger selection for TIMER7_BRKIN register */
#define TRIGSEL_TIMER14BRKIN              REG32((TRIGSEL) + 0x00000034U)    /*!< TRIGSEL trigger selection for TIMER14_BRKIN register */
#define TRIGSEL_TIMER15BRKIN              REG32((TRIGSEL) + 0x00000038U)    /*!< TRIGSEL trigger selection for TIMER15_BRKIN register */
#define TRIGSEL_TIMER16BRKIN              REG32((TRIGSEL) + 0x0000003CU)    /*!< TRIGSEL trigger selection for TIMER16_BRKIN register */
#define TRIGSEL_TIMER19BRKIN              REG32((TRIGSEL) + 0x00000040U)    /*!< TRIGSEL trigger selection for TIMER19_BRKIN register */
#define TRIGSEL_CAN0                      REG32((TRIGSEL) + 0x00000044U)    /*!< TRIGSEL trigger selection for CAN0 register */
#define TRIGSEL_CAN1                      REG32((TRIGSEL) + 0x00000048U)    /*!< TRIGSEL trigger selection for CAN1 register */
#define TRIGSEL_CAN2                      REG32((TRIGSEL) + 0x0000004CU)    /*!< TRIGSEL trigger selection for CAN2 register */
#define TRIGSEL_TIMER0ETI                 REG32((TRIGSEL) + 0x00000050U)    /*!< TRIGSEL trigger selection for TIMER0_ETI register */
#define TRIGSEL_TIMER1ETI                 REG32((TRIGSEL) + 0x00000054U)    /*!< TRIGSEL trigger selection for TIMER1_ETI register */
#define TRIGSEL_TIMER2ETI                 REG32((TRIGSEL) + 0x00000058U)    /*!< TRIGSEL trigger selection for TIMER2_ETI register */
#define TRIGSEL_TIMER3ETI                 REG32((TRIGSEL) + 0x0000005CU)    /*!< TRIGSEL trigger selection for TIMER3_ETI register */
#define TRIGSEL_TIMER4ETI                 REG32((TRIGSEL) + 0x00000060U)    /*!< TRIGSEL trigger selection for TIMER4_ETI register */
#define TRIGSEL_TIMER7ETI                 REG32((TRIGSEL) + 0x00000064U)    /*!< TRIGSEL trigger selection for TIMER7_ETI register */
#define TRIGSEL_TIMER19ETI                REG32((TRIGSEL) + 0x00000068U)    /*!< TRIGSEL trigger selection for TIMER19_ETI register */
#define TRIGSEL_HPDF                      REG32((TRIGSEL) + 0x0000006CU)    /*!< TRIGSEL trigger selection for HPDF register */
#define TRIGSEL_TIMER0ITI14               REG32((TRIGSEL) + 0x00000070U)    /*!< TRIGSEL trigger selection for TIMER0_ITI14 register */
#define TRIGSEL_TIMER1ITI14               REG32((TRIGSEL) + 0x00000074U)    /*!< TRIGSEL trigger selection for TIMER1_ITI14 register */
#define TRIGSEL_TIMER2ITI14               REG32((TRIGSEL) + 0x00000078U)    /*!< TRIGSEL trigger selection for TIMER2_ITI14 register */
#define TRIGSEL_TIMER3ITI14               REG32((TRIGSEL) + 0x0000007CU)    /*!< TRIGSEL trigger selection for TIMER3_ITI14 register */
#define TRIGSEL_TIMER4ITI14               REG32((TRIGSEL) + 0x00000080U)    /*!< TRIGSEL trigger selection for TIMER4_ITI14 register */
#define TRIGSEL_TIMER7ITI14               REG32((TRIGSEL) + 0x00000084U)    /*!< TRIGSEL trigger selection for TIMER7_ITI14 register */
#define TRIGSEL_TIMER14ITI14              REG32((TRIGSEL) + 0x00000088U)    /*!< TRIGSEL trigger selection for TIMER14_ITI14 register */
#define TRIGSEL_TIMER19ITI14              REG32((TRIGSEL) + 0x0000008CU)    /*!< TRIGSEL trigger selection for TIMER19_ITI14 register */
#define TRIGSEL_DAC0                      REG32((TRIGSEL) + 0x00000090U)    /*!< TRIGSEL trigger selection for DAC0 register */
#define TRIGSEL_DAC1                      REG32((TRIGSEL) + 0x00000094U)    /*!< TRIGSEL trigger selection for DAC1 register */
#define TRIGSEL_DAC2                      REG32((TRIGSEL) + 0x00000098U)    /*!< TRIGSEL trigger selection for DAC2 register */
#define TRIGSEL_DAC3                      REG32((TRIGSEL) + 0x0000009CU)    /*!< TRIGSEL trigger selection for DAC3 register */
#define TRIGSEL_EXTDAC0                   REG32((TRIGSEL) + 0x000000A0U)    /*!< TRIGSEL trigger selection for DAC0 extended register */
#define TRIGSEL_EXTDAC1                   REG32((TRIGSEL) + 0x000000A4U)    /*!< TRIGSEL trigger selection for DAC1 extended register */
#define TRIGSEL_EXTDAC2                   REG32((TRIGSEL) + 0x000000A8U)    /*!< TRIGSEL trigger selection for DAC2 extended register */
#define TRIGSEL_EXTDAC3                   REG32((TRIGSEL) + 0x000000ACU)    /*!< TRIGSEL trigger selection for DAC3 extended register */
#define TRIGSEL_CLA_0                     REG32((TRIGSEL) + 0x000000B0U)    /*!< TRIGSEL trigger selection for CLA register 0 */
#define TRIGSEL_CLA_1                     REG32((TRIGSEL) + 0x000000B4U)    /*!< TRIGSEL trigger selection for CLA register 1 */
#define TRIGSEL_CLA_2                     REG32((TRIGSEL) + 0x000000B8U)    /*!< TRIGSEL trigger selection for CLA register 2 */
#define TRIGSEL_CLA_3                     REG32((TRIGSEL) + 0x000000BCU)    /*!< TRIGSEL trigger selection for CLA register 3 */
#define TRIGSEL_CLA_4                     REG32((TRIGSEL) + 0x000000C0U)    /*!< TRIGSEL trigger selection for CLA register 4 */

/* bit definitions */
/* trigger input source selection */
#define TRIGSEL_TARGET_INSEL0             BITS(0,7)                         /*!< trigger input source selection for output0 */
#define TRIGSEL_TARGET_INSEL1             BITS(8,15)                        /*!< trigger input source selection for output1 */
#define TRIGSEL_TARGET_INSEL2             BITS(16,23)                       /*!< trigger input source selection for output2 */
#define TRIGSEL_TARGET_LK                 BIT(31)                           /*!< TRIGSEL register lock */

