wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_trigsel.h
/* target peripheral definitions */
typedef enum {
    TRIGSEL_OUTPUT_TRIGSEL_OUT0           = ((uint8_t)0x00U),               /*!< output target peripheral TRIGSEL_OUT0 pin */
    TRIGSEL_OUTPUT_TRIGSEL_OUT1           = ((uint8_t)0x01U),               /*!< output target peripheral TRIGSEL_OUT1 pin */
    TRIGSEL_OUTPUT_TRIGSEL_OUT2           = ((uint8_t)0x04U),               /*!< output target peripheral TRIGSEL_OUT2 pin */
    TRIGSEL_OUTPUT_TRIGSEL_OUT3           = ((uint8_t)0x05U),               /*!< output target peripheral TRIGSEL_OUT3 pin */
    TRIGSEL_OUTPUT_TRIGSEL_OUT4           = ((uint8_t)0x08U),               /*!< output target peripheral TRIGSEL_OUT4 pin */
    TRIGSEL_OUTPUT_TRIGSEL_OUT5           = ((uint8_t)0x09U),               /*!< output target peripheral TRIGSEL_OUT5 pin */
    TRIGSEL_OUTPUT_TRIGSEL_OUT6           = ((uint8_t)0x0CU),               /*!< output target peripheral TRIGSEL_OUT6 pin */
    TRIGSEL_OUTPUT_TRIGSEL_OUT7           = ((uint8_t)0x0DU),               /*!< output target peripheral TRIGSEL_OUT7 pin */
    TRIGSEL_OUTPUT_ADC0_ROUTRG            = ((uint8_t)0x10U),               /*!< output target peripheral ADC0_ROUTRG */
    TRIGSEL_OUTPUT_ADC0_INSTRG            = ((uint8_t)0x11U),               /*!< output target peripheral ADC0_INSTRG */
    TRIGSEL_OUTPUT_ADC1_ROUTRG            = ((uint8_t)0x14U),               /*!< output target peripheral ADC1_ROUTRG */
    TRIGSEL_OUTPUT_ADC1_INSTRG            = ((uint8_t)0x15U),               /*!< output target peripheral ADC1_INSTRG */
    TRIGSEL_OUTPUT_ADC2_ROUTRG            = ((uint8_t)0x18U),               /*!< output target peripheral ADC2_ROUTRG */
    TRIGSEL_OUTPUT_ADC2_INSTRG            = ((uint8_t)0x19U),               /*!< output target peripheral ADC2_INSTRG */
    TRIGSEL_OUTPUT_ADC3_ROUTRG            = ((uint8_t)0x1CU),               /*!< output target peripheral ADC3_ROUTRG */
    TRIGSEL_OUTPUT_ADC3_INSTRG            = ((uint8_t)0x1DU),               /*!< output target peripheral ADC3_INSTRG */
    TRIGSEL_OUTPUT_TIMER0_BRKIN0          = ((uint8_t)0x2CU),               /*!< output target peripheral TIMER0_BRKIN0 */
    TRIGSEL_OUTPUT_TIMER0_BRKIN1          = ((uint8_t)0x2DU),               /*!< output target peripheral TIMER0_BRKIN1 */
    TRIGSEL_OUTPUT_TIMER0_BRKIN2          = ((uint8_t)0x2EU),               /*!< output target peripheral TIMER0_BRKIN2 */
    TRIGSEL_OUTPUT_TIMER7_BRKIN0          = ((uint8_t)0x30U),               /*!< output target peripheral TIMER7_BRKIN0 */
    TRIGSEL_OUTPUT_TIMER7_BRKIN1          = ((uint8_t)0x31U),               /*!< output target peripheral TIMER7_BRKIN1 */
    TRIGSEL_OUTPUT_TIMER7_BRKIN2          = ((uint8_t)0x32U),               /*!< output target peripheral TIMER7_BRKIN2 */
    TRIGSEL_OUTPUT_TIMER14_BRKIN0         = ((uint8_t)0x34U),               /*!< output target peripheral TIMER14_BRKIN0 */
    TRIGSEL_OUTPUT_TIMER15_BRKIN0         = ((uint8_t)0x38U),               /*!< output target peripheral TIMER15_BRKIN0 */
    TRIGSEL_OUTPUT_TIMER16_BRKIN0         = ((uint8_t)0x3CU),               /*!< output target peripheral TIMER16_BRKIN0 */
    TRIGSEL_OUTPUT_TIMER19_BRKIN0         = ((uint8_t)0x40U),               /*!< output target peripheral TIMER19_BRKIN0 */
    TRIGSEL_OUTPUT_TIMER19_BRKIN1         = ((uint8_t)0x41U),               /*!< output target peripheral TIMER19_BRKIN1 */
    TRIGSEL_OUTPUT_TIMER19_BRKIN2         = ((uint8_t)0x42U),               /*!< output target peripheral TIMER19_BRKIN2 */
    TRIGSEL_OUTPUT_CAN0_EX_TIME_TICK      = ((uint8_t)0x44U),               /*!< output target peripheral CAN0_EX_TIME_TICK */
    TRIGSEL_OUTPUT_CAN1_EX_TIME_TICK      = ((uint8_t)0x48U),               /*!< output target peripheral CAN1_EX_TIME_TICK */
    TRIGSEL_OUTPUT_CAN2_EX_TIME_TICK      = ((uint8_t)0x4CU),               /*!< output target peripheral CAN2_EX_TIME_TICK */
    TRIGSEL_OUTPUT_TIMER0_ETI             = ((uint8_t)0x50U),               /*!< output target peripheral TIMER0_ETI */
    TRIGSEL_OUTPUT_TIMER1_ETI             = ((uint8_t)0x54U),               /*!< output target peripheral TIMER1_ETI */
    TRIGSEL_OUTPUT_TIMER2_ETI             = ((uint8_t)0x58U),               /*!< output target peripheral TIMER2_ETI */
    TRIGSEL_OUTPUT_TIMER3_ETI             = ((uint8_t)0x5CU),               /*!< output target peripheral TIMER3_ETI */
    TRIGSEL_OUTPUT_TIMER4_ETI             = ((uint8_t)0x60U),               /*!< output target peripheral TIMER4_ETI */
    TRIGSEL_OUTPUT_TIMER7_ETI             = ((uint8_t)0x64U),               /*!< output target peripheral TIMER7_ETI */
    TRIGSEL_OUTPUT_TIMER19_ETI            = ((uint8_t)0x68U),               /*!< output target peripheral TIMER19_ETI */
    TRIGSEL_OUTPUT_HPDF_ITRG              = ((uint8_t)0x6CU),               /*!< output target peripheral HPDF_ITRG */
    TRIGSEL_OUTPUT_TIMER0_ITI14           = ((uint8_t)0x70U),               /*!< output target peripheral TIMER0_ITI14 */
    TRIGSEL_OUTPUT_TIMER1_ITI14           = ((uint8_t)0x74U),               /*!< output target peripheral TIMER1_ITI14 */
    TRIGSEL_OUTPUT_TIMER2_ITI14           = ((uint8_t)0x78U),               /*!< output target peripheral TIMER2_ITI14 */
    TRIGSEL_OUTPUT_TIMER3_ITI14           = ((uint8_t)0x7CU),               /*!< output target peripheral TIMER3_ITI14 */
    TRIGSEL_OUTPUT_TIMER4_ITI14           = ((uint8_t)0x80U),               /*!< output target peripheral TIMER4_ITI14 */
    TRIGSEL_OUTPUT_TIMER7_ITI14           = ((uint8_t)0x84U),               /*!< output target peripheral TIMER7_ITI14 */
    TRIGSEL_OUTPUT_TIMER14_ITI14          = ((uint8_t)0x88U),               /*!< output target peripheral TIMER14_ITI14 */
    TRIGSEL_OUTPUT_TIMER19_ITI14          = ((uint8_t)0x8CU),               /*!< output target peripheral TIMER19_ITI14 */
    TRIGSEL_OUTPUT_DAC0_EXTRIG0           = ((uint8_t)0x90U),               /*!< output target peripheral DAC0_EXTRIG0 */
    TRIGSEL_OUTPUT_DAC0_EXTRIG1           = ((uint8_t)0x91U),               /*!< output target peripheral DAC0_EXTRIG1 */
    TRIGSEL_OUTPUT_DAC1_EXTRIG0           = ((uint8_t)0x94U),               /*!< output target peripheral DAC1_EXTRIG0 */
    TRIGSEL_OUTPUT_DAC1_EXTRIG1           = ((uint8_t)0x95U),               /*!< output target peripheral DAC1_EXTRIG1 */
    TRIGSEL_OUTPUT_DAC2_EXTRIG0           = ((uint8_t)0x98U),               /*!< output target peripheral DAC2_EXTRIG0 */
    TRIGSEL_OUTPUT_DAC2_EXTRIG1           = ((uint8_t)0x99U),               /*!< output target peripheral DAC2_EXTRIG1 */
    TRIGSEL_OUTPUT_DAC3_EXTRIG0           = ((uint8_t)0x9CU),               /*!< output target peripheral DAC3_EXTRIG0 */
    TRIGSEL_OUTPUT_DAC3_EXTRIG1           = ((uint8_t)0x9DU),               /*!< output target peripheral DAC3_EXTRIG1 */
    TRIGSEL_OUTPUT_DAC0_ST_EXTRIG0        = ((uint8_t)0xA0U),               /*!< output target peripheral DAC0_ST_EXTRIG0 */
    TRIGSEL_OUTPUT_DAC0_ST_EXTRIG1        = ((uint8_t)0xA1U),               /*!< output target peripheral DAC0_ST_EXTRIG1 */
    TRIGSEL_OUTPUT_DAC1_ST_EXTRIG0        = ((uint8_t)0xA4U),               /*!< output target peripheral DAC1_ST_EXTRIG0 */
    TRIGSEL_OUTPUT_DAC1_ST_EXTRIG1        = ((uint8_t)0xA5U),               /*!< output target peripheral DAC1_ST_EXTRIG1 */
    TRIGSEL_OUTPUT_DAC2_ST_EXTRIG0        = ((uint8_t)0xA8U),               /*!< output target peripheral DAC2_ST_EXTRIG0 */
    TRIGSEL_OUTPUT_DAC2_ST_EXTRIG1        = ((uint8_t)0xA9U),               /*!< output target peripheral DAC2_ST_EXTRIG1 */
    TRIGSEL_OUTPUT_DAC3_ST_EXTRIG0        = ((uint8_t)0xACU),               /*!< output target peripheral DAC3_ST_EXTRIG0 */
    TRIGSEL_OUTPUT_DAC3_ST_EXTRIG1        = ((uint8_t)0xADU),               /*!< output target peripheral DAC3_ST_EXTRIG1 */
    TRIGSEL_OUTPUT_CLA_IN0                = ((uint8_t)0xB0U),               /*!< output target peripheral CLA_IN0 */
    TRIGSEL_OUTPUT_CLA_IN1                = ((uint8_t)0xB1U),               /*!< output target peripheral CLA_IN1 */
    TRIGSEL_OUTPUT_CLA_IN2                = ((uint8_t)0xB2U),               /*!< output target peripheral CLA_IN2 */
    TRIGSEL_OUTPUT_CLA_IN3                = ((uint8_t)0xB4U),               /*!< output target peripheral CLA_IN3 */
    TRIGSEL_OUTPUT_CLA_IN4                = ((uint8_t)0xB5U),               /*!< output target peripheral CLA_IN4 */
    TRIGSEL_OUTPUT_CLA_IN5                = ((uint8_t)0xB6U),               /*!< output target peripheral CLA_IN5 */
    TRIGSEL_OUTPUT_CLA_IN6                = ((uint8_t)0xB8U),               /*!< output target peripheral CLA_IN6 */
    TRIGSEL_OUTPUT_CLA_IN7                = ((uint8_t)0xB9U),               /*!< output target peripheral CLA_IN7 */
    TRIGSEL_OUTPUT_CLA_IN8                = ((uint8_t)0xBAU),               /*!< output target peripheral CLA_IN8 */
    TRIGSEL_OUTPUT_CLA_IN9                = ((uint8_t)0xBCU),               /*!< output target peripheral CLA_IN9 */
    TRIGSEL_OUTPUT_CLA_IN10               = ((uint8_t)0xBDU),               /*!< output target peripheral CLA_IN10 */
    TRIGSEL_OUTPUT_CLA_IN11               = ((uint8_t)0xBEU)                /*!< output target peripheral CLA_IN11 */
} trigsel_periph_enum;

/* function declarations */
/* deinitialize TRIGSEL */
void trigsel_deinit(void);
/* set the trigger input signal for target peripheral */
void trigsel_init(trigsel_periph_enum target_periph, trigsel_source_enum trigger_source);
/* get the trigger input signal for target peripheral */
trigsel_source_enum trigsel_trigger_source_get(trigsel_periph_enum target_periph);
/* lock the trigger register */
void trigsel_register_lock_set(trigsel_periph_enum target_periph);
/* get the trigger register lock status */
FlagStatus trigsel_register_lock_get(trigsel_periph_enum target_periph);

#endif /* GD32G5X3_TRIGSEL_H */
